#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра

def buns():
    """ Добавить булочку """
    print("А теперь добавим булочки")


def cutlets():
    """ Добавить котлеты """
    print("А теперь добавим котлеты")


def cucumber():
    """ Добавить огурчика """
    print("А теперь добавим огуречики")


def tomato():
    """ Добавить помидорчика """
    print("А теперь добавим помидорки")


def mayonnaise():
    """ Добавить майонеза """
    print("А теперь добавим майонез")


def cheese():
    """ Добавить сыра """
    print("А теперь добавим сыра")
